In [2]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [3]:
data = [3,4,6,9,10]
data

[3, 4, 6, 9, 10]

In [4]:
import numpy as np

In [5]:
print(type(data))

<class 'list'>

In [7]:
series = pd.Series(data,dtype=np.int16)

In [8]:
series

0     3
1     4
2     6
3     9
4    10
dtype: int16

In [9]:
print(type(series))

<class 'pandas.core.series.Series'>

In [11]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
# creating a series from dictionary

data_dict = {"a":10,"b":20,"c":30,"d":40}
data_dict

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [13]:
type(data_dict)

dict

In [14]:
series_dict = pd.Series(data_dict)
series_dict

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
series_dict.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
s = pd.Series([2,'a',3.45,True])

In [17]:
s

0       2
1       a
2    3.45
3    True
dtype: object

In [18]:
s[0]

2

In [20]:
arr = np.random.randint(10,50,(9,))
arr

array([41, 10, 47, 44, 43, 46, 34, 29, 42])

In [21]:
arr.dtype

dtype('int32')

In [22]:
s2 = pd.Series(arr)

In [23]:
s2

0    41
1    10
2    47
3    44
4    43
5    46
6    34
7    29
8    42
dtype: int32

In [24]:
marks = {"Ram":100,"Navin":90,"Praveen":80}
marks

{'Ram': 100, 'Navin': 90, 'Praveen': 80}

In [25]:
names_marks = pd.Series(marks)
names_marks

Ram        100
Navin       90
Praveen     80
dtype: int64

In [26]:
arr

array([41, 10, 47, 44, 43, 46, 34, 29, 42])

In [28]:
list("abcdefghij")

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [29]:
try:
    s2 = pd.Series(arr,index = list("abcdefghij"))
    print(s2)
except Exception as e:
    print(e)

Length of values (9) does not match length of index (10)

In [30]:
try:
    s2 = pd.Series(arr,index = list("abcdefghi"))
    print(s2)
except Exception as e:
    print(e)

a    41
b    10
c    47
d    44
e    43
f    46
g    34
h    29
i    42
dtype: int32

In [31]:
s2.loc['d']#location

44

In [32]:
s2.iloc[3]# index location

44

In [33]:
s2['d']

44

In [34]:
s2.loc['b':'f']

b    10
c    47
d    44
e    43
f    46
dtype: int32

In [35]:
s2.iloc[0:3]

a    41
b    10
c    47
dtype: int32

In [39]:
s2.iloc[[1,6]]

b    10
g    34
dtype: int32

In [40]:
[10,20,11,14,15]+[2,-1,5,3,9]

[10, 20, 11, 14, 15, 2, -1, 5, 3, 9]

In [41]:
list(map(lambda x,y:x+y,[10,20,11,14,15],[2,-1,5,3,9]))

[12, 19, 16, 17, 24]

In [42]:
sa = pd.Series([10,20,11,14,15])
sb = pd.Series([2,-1,5,3,9])
sa+sb

0    12
1    19
2    16
3    17
4    24
dtype: int64

In [43]:
sb+5

0     7
1     4
2    10
3     8
4    14
dtype: int64

In [44]:
sa

0    10
1    20
2    11
3    14
4    15
dtype: int64

In [45]:
print(sa>14)

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [46]:
sa[sa>14]

1    20
4    15
dtype: int64

In [48]:
def square(x):
    return x*x

squared_series = sa.apply(square)
print(squared_series)

0    100
1    400
2    121
3    196
4    225
dtype: int64

In [49]:
sq_series = sa.apply(lambda x:x*x)
sq_series

0    100
1    400
2    121
3    196
4    225
dtype: int64

In [51]:
fruits = pd.Series(["Apple","Mango","Banana"])
fruits

0     Apple
1     Mango
2    Banana
dtype: object

In [52]:
def lower(x):
    return x.lower()

lower_fruits = fruits.apply(lower)

In [53]:
lower_fruits

0     apple
1     mango
2    banana
dtype: object

In [54]:
type(lower_fruits)

pandas.core.series.Series

In [55]:
fruits = pd.Series(["Apple","Mango","Banana"])

In [56]:
lower_fruits_using_str = fruits.str.lower()

In [57]:
lower_fruits_using_str

0     apple
1     mango
2    banana
dtype: object

In [58]:
data_m = [10,20,None,40,None]

series_nan = pd.Series(data_m)
series_nan

0    10.0
1    20.0
2     NaN
3    40.0
4     NaN
dtype: float64

In [59]:
series_nan.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [60]:
series_nan.isna().any()

True

In [61]:
series_nan.isna().sum()

2

In [62]:
series_nan.notna()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [63]:
data_m = [10,20,30,40,None,np.nan,30,24,np.nan]
series_1 = pd.Series(data_m)
series_1

0    10.0
1    20.0
2    30.0
3    40.0
4     NaN
5     NaN
6    30.0
7    24.0
8     NaN
dtype: float64

In [64]:
series_1.isna()

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
dtype: bool

In [65]:
series_1.isna().sum()

3

In [66]:
series_1.isna().any()

True

In [67]:
series_1[series_1.isna()]

4   NaN
5   NaN
8   NaN
dtype: float64

In [68]:
series_1[series_1.notna()]

0    10.0
1    20.0
2    30.0
3    40.0
6    30.0
7    24.0
dtype: float64

In [69]:
series_nan

0    10.0
1    20.0
2     NaN
3    40.0
4     NaN
dtype: float64

In [70]:
series_nan.mean()

23.333333333333332

In [75]:
series_nan.mean(skipna = False)

nan

In [76]:
series_no_null = pd.Series([10,20,30,40,np.nan])

In [77]:
series_no_null.mean()

25.0

In [78]:
s2

a    41
b    10
c    47
d    44
e    43
f    46
g    34
h    29
i    42
dtype: int32

In [79]:
s2.mean()

37.333333333333336

In [80]:
s2.sort_values()

b    10
h    29
g    34
a    41
i    42
e    43
d    44
f    46
c    47
dtype: int32

In [81]:
s2.sort_values(ignore_index=True)

0    10
1    29
2    34
3    41
4    42
5    43
6    44
7    46
8    47
dtype: int32

In [86]:
s2.sort_values(ascending=False)

c    47
f    46
d    44
e    43
i    42
a    41
g    34
h    29
b    10
dtype: int32

In [87]:
series_s = pd.Series([12,46,44,20,33,42,25,15,36,42])
series_s

0    12
1    46
2    44
3    20
4    33
5    42
6    25
7    15
8    36
9    42
dtype: int64

In [9]:
series_s = pd.DataFrame([12,46,44,20,33,42,25,15,36,42])

In [10]:
series_s

    0
0  12
1  46
2  44
3  20
4  33
5  42
6  25
7  15
8  36
9  42

In [13]:
series_s.sort_values(by=0,ignore_index=True,axis=0)

    0
0  12
1  15
2  20
3  25
4  33
5  36
6  42
7  42
8  44
9  46

In [14]:
import pandas as pd

In [19]:
data = {
    "A":[1,2,3,4],
    "B":[3,1,4,1],
    "C":[12,10,-1,0]
}
df = pd.DataFrame(data)
df

   A  B   C
0  1  3  12
1  2  1  10
2  3  4  -1
3  4  1   0

In [20]:
data = {
    "A":[1,2,3,4],
    "B":[3,1,4,1],
    "C":[12,10,-1,0]
}
df = pd.DataFrame(data,index=["r"+str(i) for i in range(len(data["A"]))])
df

    A  B   C
r0  1  3  12
r1  2  1  10
r2  3  4  -1
r3  4  1   0

In [38]:
data = {
    "A":[1,2,3,4],
    "B":[3,1,4,1],
    "C":[12,10,-1,0]
}
df = pd.DataFrame(data,index=["r"+str(i) for i in range(len(data["A"]))])
df.columns = ["C"+str(i) for i in range(len(data.keys()))]
df

    C0  C1  C2
r0   1   3  12
r1   2   1  10
r2   3   4  -1
r3   4   1   0

In [39]:
df["sum"] =df.sum(axis=1)
df

    C0  C1  C2  sum
r0   1   3  12   16
r1   2   1  10   13
r2   3   4  -1    6
r3   4   1   0    5

In [41]:
data = {
    "English":[100,100,100],
    "Math":[99,89,91],
    "Physics":[100,92,96]
}
marks = pd.DataFrame(data,index = ["Ram","Sham","Tom"])
marks

      English  Math  Physics
Ram       100    99      100
Sham      100    89       92
Tom       100    91       96

In [42]:
marks["total"] = marks.sum(axis=1)
marks

      English  Math  Physics  total
Ram       100    99      100    299
Sham      100    89       92    281
Tom       100    91       96    287

In [43]:
marks["total"]

Ram     299
Sham    281
Tom     287
Name: total, dtype: int64

In [44]:
marks["English"]

Ram     100
Sham    100
Tom     100
Name: English, dtype: int64

In [45]:
marks.loc['Ram']

English    100
Math        99
Physics    100
total      299
Name: Ram, dtype: int64

In [46]:
marks.iloc[0:1,:]

     English  Math  Physics  total
Ram      100    99      100    299

In [50]:
marks[['Math']]

      Math
Ram     99
Sham    89
Tom     91

In [56]:
marks['avg'] = marks['total']/3
marks

      English  Math  Physics  total        avg
Ram       100    99      100    299  99.666667
Sham      100    89       92    281  93.666667
Tom       100    91       96    287  95.666667

In [57]:
marks.mean(axis=0)

English    100.000000
Math        93.000000
Physics     96.000000
total      289.000000
avg         96.333333
dtype: float64

In [60]:
marks.columns

Index(['English', 'Math', 'Physics', 'total', 'avg'], dtype='object')

In [63]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [65]:

marks.columns = list('abcde')
marks

        a   b    c    d          e
Ram   100  99  100  299  99.666667
Sham  100  89   92  281  93.666667
Tom   100  91   96  287  95.666667

In [67]:
data = {
    "A":[1,2,3,4],
    "B":[3,1,4,1],
    "C":[12,10,-1,0]
}
df = pd.DataFrame(data,index=["r"+str(i) for i in range(len(data["A"]))])
df.columns = ["C"+str(i) for i in range(len(data.keys()))]
df

    C0  C1  C2
r0   1   3  12
r1   2   1  10
r2   3   4  -1
r3   4   1   0

In [70]:
df["C1"] = df["C1"].apply(lambda x:x**2)
df

    C0  C1  C2
r0   1   9  12
r1   2   1  10
r2   3  16  -1
r3   4   1   0

In [72]:
s1 = pd.Series([34,89,76,23,24])
s1

0    34
1    89
2    76
3    23
4    24
dtype: int64

In [73]:
data = pd.DataFrame(s1,columns = ["column1"])
data

   column1
0       34
1       89
2       76
3       23
4       24

In [75]:
data.iloc[2]

column1    76
Name: 2, dtype: int64

In [82]:
data.column1[2]

76

In [83]:
data['column1'][2]

76

In [85]:
data = {
    "Row1":["john",24,"B.Com"],
    "Row2":["Nick",35,"B.E"],
    "Row3":["Tom",45,"B.Arch"]
}
df = pd.DataFrame.from_dict(data)
df

    Row1  Row2    Row3
0   john  Nick     Tom
1     24    35      45
2  B.Com   B.E  B.Arch

In [86]:
data = {
    "Row1":["john",24,"B.Com"],
    "Row2":["Nick",35,"B.E"],
    "Row3":["Tom",45,"B.Arch"]
}
df = pd.DataFrame.from_dict(data,orient = "index",columns = ['Name','Age','Qualifiction'])
df

      Name  Age Qualifiction
Row1  john   24        B.Com
Row2  Nick   35          B.E
Row3   Tom   45       B.Arch

In [89]:
data = {
    "Row1":["john",24,"B.Com"],
    "Row2":["Nick",35,"B.E"],
    "Row3":["Tom",45,"B.Arch"]
}
df = pd.DataFrame.from_dict(data,orient = "index")
df

         0   1       2
Row1  john  24   B.Com
Row2  Nick  35     B.E
Row3   Tom  45  B.Arch

In [91]:
data = {
    "Name":["A","B","C","D"],
    "Desiganation":["PM","Dev","Tm","Tester"],
    "Location":["Delhi","Hydrabad","Chennai","Vizag"],
    "Salary":[20,30,43,9]
}
df = pd.DataFrame(data)
df

  Name Desiganation  Location  Salary
0    A           PM     Delhi      20
1    B          Dev  Hydrabad      30
2    C           Tm   Chennai      43
3    D       Tester     Vizag       9

In [96]:
df.index=["person"+f"{i}" for i in range(1,1+len(data["Name"]))]
df

        Name Desiganation  Location  Salary
person1    A           PM     Delhi      20
person2    B          Dev  Hydrabad      30
person3    C           Tm   Chennai      43
person4    D       Tester     Vizag       9